# Homebrew Bundle file
# Install with: brew bundle

# Taps
tap "homebrew/services"

# Core utilities
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gawk"
brew "grep"
brew "moreutils"

# Modern CLI replacements
brew "bat"          # cat replacement
brew "eza"          # ls replacement
brew "fd"           # find replacement
brew "ripgrep"      # grep replacement
brew "fzf"          # fuzzy finder
brew "zoxide"       # cd replacement
brew "procs"        # ps replacement
brew "dust"         # du replacement
brew "tokei"        # cloc replacement
brew "hyperfine"    # benchmarking
brew "delta"        # git diff viewer
brew "stow"

# Development tools
brew "git"
brew "gh"           # GitHub CLI
brew "vim"
brew "neovim"
brew "tmux"
brew "tree"
brew "jq"
brew "yq"
brew "curl"
brew "jless"
brew "wget"
brew "htop"
brew "btop"
brew "atuin"

# Programming languages & tools
#brew "node"
#brew "python3"
#brew "rust"
#brew "go"
#brew "ruby"
brew "asdf"

# Tool
brew "awscli"


# Nushell
brew "nushell"

# Shell enhancements
brew "starship"     # prompt
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Applications (Casks)
#cask "visual-studio-code"
#cask "iterm2"
#cask "docker"
#cask "firefox"
#cask "google-chrome"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
